app/controllers/api/scores_controller.rb

  def create
    username = params[:username]
    score = params[:score]
    @score = Score.new(username: username, score: score)

    if @score.save
---
INSERT INTO "scores" ("created_at", "score", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 21 Nov 2014 07:02:50 UTC +00:00], ["score", 65250], ["updated_at", Fri, 21 Nov 2014 07:02:50 UTC +00:00], ["username", "User"]]

    def update
      @score = Score.find(params[:id])
      username = params[:username]

      if @score.update(username: username)
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = $1 LIMIT 1  [["id", "90"]]
UPDATE "scores" SET "username" = $1, "updated_at" = $2 WHERE "scores"."id" = 92  [["username", "First!"], ["updated_at", Fri, 21 Nov 2014 07:07:43 UTC +00:00]]